package chapter7_1;

public class Ch7_09_Example {

}
/*
 * 1. Car 클래스
 * 	A. 색, 속도를 담을 수 있는 필드
 * 	B. 속도 증가 처리용 메소드
 * 	C. 속도 감소 처리용 메소드
 * 
 * 2. Sedan 클래스(Car클래스의 자식클래스)
 * 	A.좌석수를 담을 수 있는 필드
 * 	B.좌석수를 return해주는 메소드
 * 
 * 3. Truck 클래스(Car클래스의 자식클래스)
 * 	A.적재량을 담을 수 있는 필드
 * 	B.적재량을 return해주는 메소드
 * 
 * 4.Main 클래스
 * 	A.Sedan 초기값( 색상 : 빨간색, 속도 50, 좌석 2) 
 * 	  Truck 초기값( 검정색 속도 100 적재량5)인 객체 생성
 * 	B.Sedan의 속도를 100증가, Truck의 속도를 20감소
 * 	C.Sedan의 좌석수를 5, Truck의 적재량을 10로 설정
 * 	D.출력문
 * 	 빨간색 승용차의 속도는 200이고 좌석수는 5개 입니다.
 * 	 검정색 트럭의 속도는 100이고 적재량을 5톤 입니다.
 */
